Autodesk.Revit.DB.RevisionSettings.RoundRevisionCloudSpacing(Autodesk.Revit.DB.Document,System.Double)
Rounds the given revision cloud spacing value according to the document's settings.
ccda:
The document to use for rounding.
rawValue:
The unrounded value.
Returns:
The rounded revision cloud spacing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.RevisionSettings.GetRevisionSettings(Autodesk.Revit.DB.Document)
Returns the RevisionSettings for the given project document.
ccda:
The document to get the RevisionSettings from.
Returns:
The RevisionSettings for the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ccda is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015